//
//  MyAPITool.swift
//  AIJIAIJIAShopSwift
//
//  Created by 赵春生 on 2017/6/27.
//  Copyright © 2017年 zcs. All rights reserved.
//

import UIKit
//版本号-关于我们
public let UsVersion = "v1.0.0"
//版本号-更新版本比对
public let UsVersion_Compare = "1.00"
/**
 *-------------------------------------------------------------------
 *                          id配置
 *-------------------------------------------------------------------
 */


/**
 *-------------------------------------------------------------------
 *                          H5链接
 *-------------------------------------------------------------------
 */


/**
 *-------------------------------------------------------------------
 *                          注册登录模块
 *-------------------------------------------------------------------
 */
public let api_login            = ""
//退出登录
public let api_logout           = ""
//获取验证码
public let api_postphonenum_getsmscode  = ""
//注册
public let api_register         = ""
//修改密码
public let api_updatepassword   = ""

/**
 *-------------------------------------------------------------------
 *                          个人资料模块
 *-------------------------------------------------------------------
 */
//个人信息
public let api_userinfo         = ""
//保存昵称
public let api_userinfo_savenickname    = ""
//保存性别
public let api_userinfo_savegender      = ""
//头像上传
public let api_upload           = ""
/**
 *-------------------------------------------------------------------
 *                          BASE模块
 *-------------------------------------------------------------------
 */
//产品详情信息
public let api_products_info    = ""
